<?xml version="1.0" ?>
<net name="compressed_model" version="10">
	<layers>
		<layer id="0" name="Resize_821/axis1141051594" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Resize_821/Add_input_port_1/value1141450769" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data_add_2402624031" type="Const" version="opset1">
			<data offset="20" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_2401824023" type="Const" version="opset1">
			<data offset="532" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_2401024015" type="Const" version="opset1">
			<data offset="1044" size="96" shape="1,48,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_2359423599" type="Const" version="opset1">
			<data offset="1140" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_67" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="778">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_6851585" type="Const" version="opset1">
			<data offset="1190" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="779">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_6751519" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="778">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_68" type="Const" version="opset1">
			<data offset="1190" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="779">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_2358623591" type="Const" version="opset1">
			<data offset="1192" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_59" type="Const" version="opset1">
			<data offset="1384" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="770">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_5951387" type="Const" version="opset1">
			<data offset="1384" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="770">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_6051417" type="Const" version="opset1">
			<data offset="1576" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="771">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_60" type="Const" version="opset1">
			<data offset="1576" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="771">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_2357823583" type="Const" version="opset1">
			<data offset="1768" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="data_add_2357023575" type="Const" version="opset1">
			<data offset="1960" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_31" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="733">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_32" type="Const" version="opset1">
			<data offset="1992" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="734">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_3151570" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="733">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_3250844" type="Const" version="opset1">
			<data offset="1992" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="734">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_2356223567" type="Const" version="opset1">
			<data offset="1994" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_8" type="Const" version="opset1">
			<data offset="2058" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="701">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_851285" type="Const" version="opset1">
			<data offset="2058" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="701">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_9" type="Const" version="opset1">
			<data offset="2122" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="702">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_951264" type="Const" version="opset1">
			<data offset="2122" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="702">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_2355423559" type="Const" version="opset1">
			<data offset="2186" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_050691" type="Const" version="opset1">
			<data offset="2250" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="693">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_150886" type="Const" version="opset1">
			<data offset="2256" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="694">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_0" type="Const" version="opset1">
			<data offset="2262" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="693">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_1" type="Const" version="opset1">
			<data offset="2264" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="694">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="x.1" type="Parameter" version="opset1">
			<data shape="1,3,288,480" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="x.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="FakeQuantize_2" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="695">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="BatchNormalization_4/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="2266" size="1728" shape="32,3,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.0.0.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_3" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="BatchNormalization_4/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="697">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Clip_7" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="700">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FakeQuantize_10" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="703">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="BatchNormalization_27/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="3994" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.1.conv.0.weight">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_26" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="BatchNormalization_27/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="729">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Clip_30" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="732">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="FakeQuantize_33" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="735">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="BatchNormalization_35/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="4570" size="1024" shape="16,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.1.conv.3.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_34" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="BatchNormalization_35/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="737">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_36" type="Const" version="opset1">
			<data offset="5594" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="738">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_3750907" type="Const" version="opset1">
			<data offset="5596" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="739">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_3650700" type="Const" version="opset1">
			<data offset="5594" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="738">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_37" type="Const" version="opset1">
			<data offset="5596" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="739">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FakeQuantize_38" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="740">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="BatchNormalization_55/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="5598" size="3072" shape="96,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.2.conv.0.weight">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_54" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="BatchNormalization_55/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="766">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Clip_58" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="769">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="FakeQuantize_61" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="772">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="BatchNormalization_63/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="8670" size="1728" shape="96,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.2.conv.3.weight">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_62" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="BatchNormalization_63/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="774">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Clip_66" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="777">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="FakeQuantize_69" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="780">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization_71/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="10398" size="4608" shape="24,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.2.conv.6.weight">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_70" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="BatchNormalization_71/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="782">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_72" type="Const" version="opset1">
			<data offset="15006" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="783">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_73" type="Const" version="opset1">
			<data offset="15008" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="784">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_7251279" type="Const" version="opset1">
			<data offset="15006" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="783">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_7351057" type="Const" version="opset1">
			<data offset="15008" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="784">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="FakeQuantize_74" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="785">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_2361823623" type="Const" version="opset1">
			<data offset="15010" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_10351471" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="823">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_104" type="Const" version="opset1">
			<data offset="15058" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="824">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_103" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="823">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_10451561" type="Const" version="opset1">
			<data offset="15058" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="824">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_add_2361023615" type="Const" version="opset1">
			<data offset="15060" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_95" type="Const" version="opset1">
			<data offset="15348" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="815">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_9550856" type="Const" version="opset1">
			<data offset="15348" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="815">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_96" type="Const" version="opset1">
			<data offset="15636" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="816">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_9651243" type="Const" version="opset1">
			<data offset="15636" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="816">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_2360223607" type="Const" version="opset1">
			<data offset="15924" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="BatchNormalization_91/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="16212" size="6912" shape="144,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.3.conv.0.weight">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_90" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="BatchNormalization_91/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="811">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Clip_94" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="814">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="FakeQuantize_97" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="817">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="BatchNormalization_99/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="23124" size="2592" shape="144,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.3.conv.3.weight">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_98" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="BatchNormalization_99/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="819">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Clip_102" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="822">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="FakeQuantize_105" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="825">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="BatchNormalization_107/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data offset="25716" size="6912" shape="24,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="nncf_module.backbone.features.3.conv.6.weight">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_106" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="BatchNormalization_107/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="827">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_108" type="Const" version="opset1">
			<data offset="32628" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="828">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_109" type="Const" version="opset1">
			<data offset="32630" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="829">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_10851207" type="Const" version="opset1">
			<data offset="32628" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="828">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_10951126" type="Const" version="opset1">
			<data offset="32630" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="829">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="FakeQuantize_110" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="830">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Add_111" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="831">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_112" type="Const" version="opset1">
			<data offset="32632" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="832">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_11351540" type="Const" version="opset1">
			<data offset="32634" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="833">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_11251027" type="Const" version="opset1">
			<data offset="32632" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="832">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_113" type="Const" version="opset1">
			<data offset="32634" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="833">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="FakeQuantize_114" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="834">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_742/quantized4294550469" type="Const" version="opset1">
			<data offset="32636" size="1152" shape="48,24,1,1" element_type="i8"/>
			<output>
				<port id="0" precision="I8">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_742/quantized/to_f16" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="FakeQuantize_745/zero_point4296450349" type="Const" version="opset1">
			<data offset="33788" size="96" shape="48,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="FakeQuantize_745/minus_zp" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="FakeQuantize_745/scale4295351033" type="Const" version="opset1">
			<data offset="33884" size="96" shape="48,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="FakeQuantize_745/mulpiply_by_scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1591">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_746" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="BatchNormalization_747/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1593">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_749" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1595">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_750" type="Const" version="opset1">
			<data offset="33980" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1596">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_74951579" type="Const" version="opset1">
			<data offset="1188" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1595">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_75050925" type="Const" version="opset1">
			<data offset="33980" size="2" shape="1,1,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1596">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="FakeQuantize_751" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="1597">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Resize_770/axis1137850430" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Resize_770/Add_input_port_1/value1138251177" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="data_add_2400224007" type="Const" version="opset1">
			<data offset="33982" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="data_add_2399423999" type="Const" version="opset1">
			<data offset="34494" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
