<?xml version="1.0" ?>
<net name="deeplab_mobilenet_fp16" version="10">
	<layers>
		<layer id="0" name="Resize_496/axis468019601" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Resize_496/Add_input_port_1/value468419553" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="decoder.last_conv.8.weight" type="Const" version="opset1">
			<data offset="20" size="1024" shape="2,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="decoder.last_conv.8.weight">
					<dim>2</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="1251" type="Const" version="opset1">
			<data offset="1044" size="1179648" shape="256,256,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1251">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="1248" type="Const" version="opset1">
			<data offset="1180692" size="1400832" shape="256,304,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1248">
					<dim>256</dim>
					<dim>304</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1245" type="Const" version="opset1">
			<data offset="2581524" size="2304" shape="48,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1245">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1098" type="Const" version="opset1">
			<data offset="2583828" size="6912" shape="24,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1098">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="1092" type="Const" version="opset1">
			<data offset="2590740" size="6912" shape="144,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1092">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1089" type="Const" version="opset1">
			<data offset="2597652" size="4608" shape="24,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1089">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="1083" type="Const" version="opset1">
			<data offset="2602260" size="3072" shape="96,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1083">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="1080" type="Const" version="opset1">
			<data offset="2605332" size="1024" shape="16,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1080">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,288,480" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="1074" type="Const" version="opset1">
			<data offset="2606356" size="1728" shape="32,3,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1074">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_0/Dims5880" type="Const" version="opset1">
			<data offset="2608084" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1073">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Clip_3" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="367">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="1077" type="Const" version="opset1">
			<data offset="2608148" size="576" shape="32,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1077">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_19/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_19/Dims5940" type="Const" version="opset1">
			<data offset="2608724" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1076">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Clip_22" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="396">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_23/Dims5754" type="Const" version="opset1">
			<data offset="2608788" size="32" shape="1,16,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1079">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_39/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_39/Dims5802" type="Const" version="opset1">
			<data offset="2608820" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1082">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Clip_42" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="427">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="1086" type="Const" version="opset1">
			<data offset="2609012" size="1728" shape="96,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1086">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_43/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_43/Dims5652" type="Const" version="opset1">
			<data offset="2610740" size="192" shape="1,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1085">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Clip_46" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="432">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_47/Dims5862" type="Const" version="opset1">
			<data offset="2610932" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1088">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_63/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_63/Dims5928" type="Const" version="opset1">
			<data offset="2610980" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1091">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Clip_66" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="463">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="1095" type="Const" version="opset1">
			<data offset="2611268" size="2592" shape="144,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1095">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_67/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_67/Dims5844" type="Const" version="opset1">
			<data offset="2613860" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_67" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1094">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Clip_70" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="468">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_71/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_71/Dims5742" type="Const" version="opset1">
			<data offset="2614148" size="48" shape="1,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_71" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1097">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Add_72" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="471">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_451/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_451/Dims5694" type="Const" version="opset1">
			<data offset="2614196" size="96" shape="1,48,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_451" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1244">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Relu_452" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="1026">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Resize_471/axis464819550" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Resize_471/Add_input_port_1/value465219346" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="1242" type="Const" version="opset1">
			<data offset="2614292" size="655360" shape="256,1280,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1242">
					<dim>256</dim>
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1227" type="Const" version="opset1">
			<data offset="3269652" size="163840" shape="256,320,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1227">
					<dim>256</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1224" type="Const" version="opset1">
			<data offset="3433492" size="614400" shape="320,960,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1224">
					<dim>320</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="1218" type="Const" version="opset1">
			<data offset="4047892" size="307200" shape="960,160,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1218">
					<dim>960</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="1206" type="Const" version="opset1">
			<data offset="4355092" size="307200" shape="160,960,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1206">
					<dim>160</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="1200" type="Const" version="opset1">
			<data offset="4662292" size="307200" shape="960,160,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1200">
					<dim>960</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1197" type="Const" version="opset1">
			<data offset="4969492" size="184320" shape="160,576,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1197">
					<dim>160</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1191" type="Const" version="opset1">
			<data offset="5153812" size="110592" shape="576,96,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1191">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="1170" type="Const" version="opset1">
			<data offset="5264404" size="73728" shape="96,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1170">
					<dim>96</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1164" type="Const" version="opset1">
			<data offset="5338132" size="49152" shape="384,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1164">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1143" type="Const" version="opset1">
			<data offset="5387284" size="49152" shape="64,384,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1143">
					<dim>64</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1137" type="Const" version="opset1">
			<data offset="5436436" size="49152" shape="384,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1137">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1134" type="Const" version="opset1">
			<data offset="5485588" size="24576" shape="64,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1134">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1128" type="Const" version="opset1">
			<data offset="5510164" size="12288" shape="192,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1128">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="1107" type="Const" version="opset1">
			<data offset="5522452" size="9216" shape="32,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1107">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="1101" type="Const" version="opset1">
			<data offset="5531668" size="6912" shape="144,24,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1101">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_88/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_88/Dims5682" type="Const" version="opset1">
			<data offset="5538580" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_88" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1100">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Clip_91" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="500">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="1104" type="Const" version="opset1">
			<data offset="5538868" size="2592" shape="144,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1104">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_92/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_92/Dims5856" type="Const" version="opset1">
			<data offset="5541460" size="288" shape="1,144,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_92" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1103">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Clip_95" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="505">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_96/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_96/Dims5790" type="Const" version="opset1">
			<data offset="5541748" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_96" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1106">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1116" type="Const" version="opset1">
			<data offset="5541812" size="12288" shape="32,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1116">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="1110" type="Const" version="opset1">
			<data offset="5554100" size="12288" shape="192,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1110">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_112/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_112/Dims5712" type="Const" version="opset1">
			<data offset="5566388" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_112" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1109">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Clip_115" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="536">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1113" type="Const" version="opset1">
			<data offset="5566772" size="3456" shape="192,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1113">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_116/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_116/Dims5634" type="Const" version="opset1">
			<data offset="5570228" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_116" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1112">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Clip_119" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="541">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Conv_120/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_120/Dims5838" type="Const" version="opset1">
			<data offset="5570612" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_120" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1115">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Add_121" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="544">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="1125" type="Const" version="opset1">
			<data offset="5570676" size="12288" shape="32,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1125">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1119" type="Const" version="opset1">
			<data offset="5582964" size="12288" shape="192,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1119">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_137/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_137/Dims5622" type="Const" version="opset1">
			<data offset="5595252" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_137" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1118">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Clip_140" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="573">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="1122" type="Const" version="opset1">
			<data offset="5595636" size="3456" shape="192,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1122">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_141/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_141/Dims5700" type="Const" version="opset1">
			<data offset="5599092" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_141" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1121">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Clip_144" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="578">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_145/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_145/Dims5586" type="Const" version="opset1">
			<data offset="5599476" size="64" shape="1,32,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_145" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1124">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Add_146" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="581">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_162/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_162/Dims5868" type="Const" version="opset1">
			<data offset="5599540" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_162" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1127">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Clip_165" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="610">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="1131" type="Const" version="opset1">
			<data offset="5599924" size="3456" shape="192,1,1,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="1131">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_166/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_166/Dims5910" type="Const" version="opset1">
			<data offset="5603380" size="384" shape="1,192,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_166" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1130">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Clip_169" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="615">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_170/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
