<?xml version="1.0" ?>
<net name="deeplab_mobilenetv3" version="10">
	<layers>
		<layer id="0" name="Resize_287/axis426820911" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Resize_287/Add_input_port_1/value427220779" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="1164" type="Const" version="opset1">
			<data offset="20" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="1164">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="decoder.last_conv.8.weight" type="Const" version="opset1">
			<data offset="36" size="2048" shape="2,256,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="decoder.last_conv.8.weight">
					<dim>2</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="1073" type="Const" version="opset1">
			<data offset="2084" size="2359296" shape="256,256,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1073">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1070" type="Const" version="opset1">
			<data offset="2361380" size="2801664" shape="256,304,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1070">
					<dim>256</dim>
					<dim>304</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1067" type="Const" version="opset1">
			<data offset="5163044" size="4608" shape="48,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1067">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="917" type="Const" version="opset1">
			<data offset="5167652" size="6912" shape="24,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="917">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="911" type="Const" version="opset1">
			<data offset="5174564" size="4608" shape="72,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="911">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="902" type="Const" version="opset1">
			<data offset="5179172" size="1024" shape="16,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="902">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="896" type="Const" version="opset1">
			<data offset="5180196" size="1024" shape="16,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="896">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,288,480" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="893" type="Const" version="opset1">
			<data offset="5181220" size="1728" shape="16,3,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="893">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_0/Dims5495" type="Const" version="opset1">
			<data offset="5182948" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="892">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_1" type="Const" version="opset1">
			<data offset="5183012" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="371">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="372">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="373">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Clip_4" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="378">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="379">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="1077" type="Const" version="opset1">
			<data offset="5183016" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1077">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Div_6" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="382">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_7/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_7/Dims5171" type="Const" version="opset1">
			<data offset="5182948" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="895">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="385">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="899" type="Const" version="opset1">
			<data offset="5183020" size="576" shape="16,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="899">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_9/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_9/Dims5423" type="Const" version="opset1">
			<data offset="5182948" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="898">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="388">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_11/Dims5399" type="Const" version="opset1">
			<data offset="5182948" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="901">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="1080" type="Const" version="opset1">
			<data offset="5183016" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1080">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="908" type="Const" version="opset1">
			<data offset="5183596" size="256" shape="16,4,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="908">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="905" type="Const" version="opset1">
			<data offset="5183852" size="256" shape="4,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="905">
					<dim>4</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="498" type="Const" version="opset1">
			<data offset="5184108" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="39" name="500" type="Const" version="opset1">
			<data offset="5184116" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="40" name="GlobalAveragePool_12/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="GlobalAveragePool_12/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="GlobalAveragePool_12/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data offset="5184124" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="GlobalAveragePool_12/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="44" name="GlobalAveragePool_12/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="GlobalAveragePool_12/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="391">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_13/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_13/Dims5519" type="Const" version="opset1">
			<data offset="5184132" size="16" shape="1,4,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="904">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Relu_14" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="394">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_9038" type="Const" version="opset1">
			<data offset="5184148" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_15/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="398">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="399">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Clip_19" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="404">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Div_20" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="407">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Mul_21" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="408">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Add_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="409">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_23/Dims5459" type="Const" version="opset1">
			<data offset="5184212" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="910">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Relu_24" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="412">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="914" type="Const" version="opset1">
			<data offset="5184500" size="2592" shape="72,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="914">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_25/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_25/Dims5465" type="Const" version="opset1">
			<data offset="5184212" size="288" shape="1,72,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_25" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="913">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Relu_26" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="415">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_27/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_27/Dims5231" type="Const" version="opset1">
			<data offset="5187092" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_27" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="916">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="926" type="Const" version="opset1">
			<data offset="5187188" size="8448" shape="24,88,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="926">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="920" type="Const" version="opset1">
			<data offset="5195636" size="8448" shape="88,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="920">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_28/Dims5393" type="Const" version="opset1">
			<data offset="5204084" size="352" shape="1,88,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="919">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Relu_29" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="420">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="923" type="Const" version="opset1">
			<data offset="5204436" size="3168" shape="88,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="923">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_30/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_30/Dims5489" type="Const" version="opset1">
			<data offset="5204084" size="352" shape="1,88,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="922">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="423">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_32/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_32/Dims5237" type="Const" version="opset1">
			<data offset="5187092" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="925">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Add_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="426">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_262/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_262/Dims5195" type="Const" version="opset1">
			<data offset="5207604" size="192" shape="1,48,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_262" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1066">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Relu_263" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="853">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Resize_272/axis423620953" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Resize_272/Add_input_port_1/value424020983" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="1160" type="Const" version="opset1">
			<data offset="5207796" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="1160">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="1064" type="Const" version="opset1">
			<data offset="5207812" size="1048576" shape="256,1024,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1064">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="1052" type="Const" version="opset1">
			<data offset="6256388" size="98304" shape="256,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1052">
					<dim>256</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Div_177_copy" type="Const" version="opset1">
			<data offset="6354692" size="110592" shape="96,288,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1013">
					<dim>96</dim>
					<dim>288</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1007" type="Const" version="opset1">
			<data offset="6465284" size="55296" shape="288,48,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1007">
					<dim>288</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Div_124_copy" type="Const" version="opset1">
			<data offset="6520580" size="23040" shape="48,120,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="980">
					<dim>48</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="974" type="Const" version="opset1">
			<data offset="6543620" size="19200" shape="120,40,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="974">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Div_47_copy" type="Const" version="opset1">
			<data offset="6562820" size="15360" shape="40,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="935">
					<dim>40</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="929" type="Const" version="opset1">
			<data offset="6578180" size="9216" shape="96,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="929">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_34/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_34/Dims5447" type="Const" version="opset1">
			<data offset="6587396" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_34" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="928">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_35" type="Const" version="opset1">
			<data offset="5183012" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="429">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Add_36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="430">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Relu_37" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="431">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Clip_38" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="436">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Mul_39" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="440">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Div_40_copy" type="Const" version="opset1">
			<data offset="6587780" size="9600" shape="96,1,1,5,5" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="932">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_41/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="2,2" pads_end="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_41/Dims5321" type="Const" version="opset1">
			<data offset="6587396" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="931">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_42" type="Const" version="opset1">
			<data offset="5183012" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="443">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Add_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="444">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Relu_44" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="445">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Clip_45" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="450">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Mul_46" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="454">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>40</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_48/Dims5507" type="Const" version="opset1">
			<data offset="6597380" size="160" shape="1,40,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="934">
					<dim>1</dim>
					<dim>40</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="1089" type="Const" version="opset1">
			<data offset="5183016" size="4" shape="1,1,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1089">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="941" type="Const" version="opset1">
			<data offset="6597540" size="1600" shape="40,10,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="941">
					<dim>40</dim>
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="938" type="Const" version="opset1">
			<data offset="6599140" size="1600" shape="10,40,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="938">
					<dim>10</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="503" type="Const" version="opset1">
			<data offset="5184108" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="124" name="505" type="Const" version="opset1">
			<data offset="5184116" size="8" shape="" element_type="i64"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="125" name="GlobalAveragePool_49/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="GlobalAveragePool_49/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="GlobalAveragePool_49/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data offset="5184124" size="8" shape="1" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="GlobalAveragePool_49/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="129" name="GlobalAveragePool_49/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="GlobalAveragePool_49/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
